USE [WebStor]

/*Задача 1

Напишіть запит, який поверне список офісів східного регіону з ціллю по продажах менше або рівної 350000.00.

- Використовується таблиця [dbo].[OFFICES]

- Результуючий набір даних містить: Ідентифікатор офісу, місто, ідентифікатор керівника офісу */

SELECT [OFFICE], [CITY], [MGR]
FROM [dbo].[OFFICES]
WHERE REGION = 'Eastern' AND TARGET <= 350000.00;



/*Задача 2.1

Напишіть запит, що повертає список замовлень, які були проведені не в 2008 році.

Враховуйте тільки замовлення на товари з ідентифікатором товарів (PRODUCT), які містять «A» другим символом або «0» в будь-якому місці.

- Використовується таблиця [dbo].[ORDERS]

- Задійте предикат LIKE

- Задійте предикат NOT BETWEEN

- Результуючий набір даних містить усі стовпці*/

SELECT *
FROM [dbo].[ORDERS]
WHERE ORDER_DATE NOT BETWEEN 2008 AND 2008 AND PRODUCT LIKE '_A%' OR  PRODUCT LIKE '%O%';



/*Задача 2.2

Напишіть запит, що повертає загальну суму проведених замовлень по ідент. виробника товарів (MFR),

які були проведені не в 2008 році. Враховуйте тільки замовлення на товари з ідентифікатором товарів (PRODUCT), які містять

A другим символом або 0 в будь-якому місці.

- Використовується таблиця [dbo].[ORDERS]

- Задійте предикат LIKE

- Задійте предикат NOT BETWEEN

- Задійте агрегатну функцію SUM

- Результуючий набір даних містить: Ідент. виробника товарів, кіль-ть унікальних замовлень

- Відсортуйте результат за загальною сумою (за зростанням)*/

SELECT [MFR], 
COUNT(DISTINCT ORDER_NUM) AS UNIQUEORDERS, SUM([AMOUNT]) AS TOTALAMOUNT
FROM [dbo].[ORDERS]
WHERE ORDER_DATE NOT BETWEEN 2008 AND 2008 AND PRODUCT LIKE '_A%' OR  PRODUCT LIKE '%O%'
GROUP BY [MFR]
ORDER BY TOTALAMOUNT ASC;



/*Задача 2.3

Напишіть запит, що повертає ідент. виробника з найбільшою загальною сумою проведених замовлень.

Враховуйте ймовірність того, що одразу кілька виробників можуть мати одну і ту ж загальну суму.

Враховуйте тільки замовлення, які були проведені не в 2008 році.

Враховуйте тільки замовлення на товари з ідентифікатором товарів (PRODUCT), які містять

A другим символом або 0 в будь-якому місці.

- Використовується таблиця [dbo].[ORDERS]

- Задійте предикат LIKE

- Задійте предикат NOT BETWEEN

- Задійте агрегатну функцію SUM

- Задійте фільтр TOP і оператор WITH TIES

- Результуючий набір даних містить: Ідент. виробника товарів, загальна сума*/

SELECT TOP 1 WITH TIES [MFR],
SUM ([AMOUNT]) AS TOTALAMOUNT
FROM [dbo].[ORDERS]
WHERE ORDER_DATE NOT BETWEEN 2008 AND 2008 AND PRODUCT LIKE '_A%' OR  PRODUCT LIKE '%O%'
GROUP BY [MFR]
ORDER BY TOTALAMOUNT ASC;



/* Задача 3

Напишіть запит, який поверне ідент. офісу з найбільшою кількістю працівників.

Враховуйте ймовірність того, що відразу кілька офісів можуть мати одну й ту саму кількість працівників.

Враховуйте лише працівників на посаді Sales Rep та у віці 29, 45, 48.

- Використовується таблиця [dbo].[SALESREPS]

- Задіяти предикат IN

- Задіяйте агрегатну функцію COUNT

- Задійте фільтр TOP та оператор WITH TIES

- Результуючий набір даних містить: Ідент. офісу, кількість працівників */

SELECT TOP 1 WITH TIES [REP_OFFICE],  COUNT([EMPL_NUM]) AS EMPL_NUM
FROM [dbo].[SALESREPS]
WHERE [TITLE] = 'Sales Rep' AND [AGE] IN (29, 45, 48)
GROUP BY [REP_OFFICE]
ORDER BY EMPL_NUM DESC;



/* Задача 4

Напишіть запит, який поверне дані продукту з найбільшою довжиною (за кількістю символів) опису.

Враховуйте ймовірність того, що одразу кілька товарів можуть мати однакову кількість символів в описі.

- Використовується таблиця [dbo].[PRODUCTS]

- Застосуйте строкову функцію `LEN`

- Результируючий набір даних містить: Ідент. виробника, ідент. продукту, опис продукту, довжину опису.*/

SELECT TOP 1 WITH TIES [MFR_ID], [PRODUCT_ID], [DESCRIPTION], LEN ([DESCRIPTION]) AS Length
FROM [dbo].[PRODUCTS]
ORDER BY Length DESC;



/* Задача 5

Напишіть запит, що повертає дані продуктів, ідентифікатор яких містить лише цифри.

Склейте значення стовпців (конкатенація): MFR_ID, PRODUCT_ID, [DESCRIPTION]. Врахуйте, що між значеннями стовпців має бути лише один пробіл. При необхідності видаліть хвостові пробіли.

Порахуйте кількість символів у сконкатенованому рядку. Видаліть дублюючі рядки у результуючому наборі даних.

- Використовується таблиця [dbo].[PRODUCTS]

- Застосуйте предикат `NOT LIKE`

- Застосуйте строкові функції: `CONCAT_WS`, `UPPER`, `LEN`, `RTRIM`

- Результируючий набір даних містить: сконкатенований рядок, довжина сконкатенованого рядка

- Відсортуйте результируючий набір даних за довжиною сконкатенованого рядка (за зменшенням) */

SELECT  CONCAT_WS(' ', UPPER(RTRIM(MFR_ID)), [PRODUCT_ID], RTRIM([DESCRIPTION])) AS STRING,
LEN (CONCAT_WS(' ', UPPER(RTRIM(MFR_ID)), [PRODUCT_ID], RTRIM([DESCRIPTION]))) AS LENGTH
FROM [dbo].[PRODUCTS]
WHERE [PRODUCT_ID] NOT LIKE '%[^0-9]%'
ORDER BY LENGTH DESC;



/* Задача 6

Напишіть запит, який поверне список клієнтів з найменшим кредитним лімітом.

Враховуйте ймовірність того, що одразу кілька клієнтів можуть мати однаковий кредитний ліміт.

Результируючий набір даних містить: ідент. клієнта, найменування клієнта, кредитний ліміт.

Найменування клієнта необхідно відобразити як 2 букви на початку рядка і 2 букви в кінці рядка, всі інші букви замінити на символ *.

- Використовується таблиця [dbo].[CUSTOMERS] */

SELECT [COMPANY], CONCAT(SUBSTRING ([COMPANY], 1, 2), REPLICATE('*', LEN([COMPANY]) - 4), SUBSTRING([COMPANY], LEN([COMPANY]) - 1, 2)) AS ConcatenatedString,[CREDIT_LIMIT] 
FROM [dbo].[CUSTOMERS]
WHERE [CREDIT_LIMIT] = (SELECT MIN([CREDIT_LIMIT]) FROM [dbo].[CUSTOMERS])
ORDER BY [CUST_REP];